Tests/NASA_NV/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet).*"
    {
        type            calculated;
        value           uniform 0;
    }
    
    "(outlet).*"
    {
        type            calculated;
        value           uniform 0;
    }
    
    ".*(walls).*"
    {
        type            compressible::alphatWallFunction;
        Prt             0.62;
        value           uniform 0;
    }
    
    #include "constr.include"
    
}


// ************************************************************************* //
