Tests/NASA_NV/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 200000;

boundaryField
{
    "(inlet).*"
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0004989;
        value           $internalField;
    }
    
    "(outlet).*"
    {
        type            zeroGradient;
    }
    
    ".*(walls).*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    
    #include "constr.include"
    
}


// ************************************************************************* //
