Tests/NASA_NV/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          36;
        startFace       152276;
    }
    outlet
    {
        type            patch;
        nFaces          836;
        startFace       152312;
    }
    axes
    {
        type            patch;
        nFaces          0;
        startFace       153148;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          24;
        startFace       153148;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          76512;
        startFace       153172;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          76512;
        startFace       229684;
    }
)

// ************************************************************************* //
