Tests/NASA_NV/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|U|h|p|k).*"
    {
        solver          PCG;
        preconditioner  DIC;
        
        
        tolerance       1e-015;
        relTol          1e-7;
    }
    
    "(k|epsilon|omega).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        
        
        tolerance       1e-015;
        relTol          1e-7;
    }
}

PIMPLE
{
    momentumPredictor		no;
    nNonOrthogonalCorrectors 	0;
    
    nCorrectors			2;
    nOuterCorrectors		1;
        
    nonOrthogonalityThreshold	15.0;
    skewnessThreshold		0.5;
    
    updateEnergyInPISO          false;
    fluxScheme                  Kurganov;

    kappaFunction
    {
        type standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
            writeMaxMin    false;
        }
    }
                                                
}

// ************************************************************************* //
